app/views/galleries/_form.html.erb

  <ul class="thumbnails files">
<% unless @gallery.pictures.empty? %>
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."gallery_id" = ?  [["gallery_id", 2]]
SELECT 1 AS one FROM "pictures" WHERE "pictures"."gallery_id" = ? LIMIT 1  [["gallery_id", 2]]